chat_system_445902629_actor_description=Old Chvakha. Very old swamp witch.
chat_system_445902629_snap_0_question=^?^You said you're helping? Perhaps you could help me as well? Tell me, what do you think of dwarves?
chat_system_445902629_snap_0_answer_0=^?^I have nothing to do with dwarves, actually. I'm pure human. Dwarves are very different.
chat_system_445902629_snap_1_question=^?^Hmm, look at him, how careful he is. Well, well. Recently one dwarf - Foritop - moved into our swamp.<br>He's ruining my reputation with all his chemical experiments. People may start believing in science, and turn away from the natural cures. So I want this dwarf to stop selling his hideous medicines.<br>I have decided that if his medicines - or even better - if his equipment were spoiled, he would stop his experiments. What do you think?<br>[reward]
chat_system_445902629_snap_1_answer_0=^?^Hmm. If nobody gets hurt, I think I could help.
chat_system_445902629_snap_1_answer_1=^?^Just look at what evil plans she has! Old witch, I will not hurt an innocent dwarf!
chat_system_445902629_snap_2_question=^?^Well I have one potion: the Stinky Elixir.<br>He boils his chemicals in a big cauldron near his house. So if the Elixir is poured into that cauldron, his work will go to waste. Even if he does not leave the swamp, he'll forget about his chemistry for a long time to come.
chat_system_445902629_snap_2_answer_0=^?^Give me the elixir.
chat_system_445902629_snap_3_question=^?^So, have you decided to go to the dwarf?
chat_system_445902629_snap_3_answer_0=^?^Yes, I have. How did you plan to stop him?
chat_system_445902629_snap_4_question=^?^You have returned! Did you get to the dwarf?
chat_system_445902629_snap_4_answer_0=^?^No, not yet. I haven't had the time yet.
chat_system_445902629_snap_4_answer_1=^?^Yes. That was really something. His cauldron with his chemicals shattered. It's a good thing that I wasn't injured, or worse!
chat_system_445902629_snap_5_question=^?^So, what about the dwarf? Will he be leaving the swamp?
chat_system_445902629_snap_5_answer_0=^?^I don't know. I didn't talk to him.
chat_system_445902629_snap_5_answer_1=^?^I'm afraid he will not. He was not in the least upset; on the contrary, he was quite pleased. As it turns out, he was experimenting with explosives and was having quite some difficulty discovering a suitable one.<br>Your potion was the best he had ever conceived of. So he sends you his greetings, and great thanks. Also he promised to send a present. As a sign of his gratitude, sorry to say.
chat_system_445902629_snap_6_question=^?^It's a pity; you might have learned a lot of new dwarven curses from him, ha-ha. The dwarves are very good in using foul language.<br>But thank you for the help, my darling.<br>[reward]
chat_system_445902629_snap_6_answer_0=^?^Thank you, granny. I was glad to help.
chat_system_445902629_snap_7_question=^?^He is strange, this Foritop. You play a dirty trick on him and he thanks you. Who can understand these dwarves?<br>Well, thank you, good man, for trying to help. Come again! - I'll be always glad to see you.<br>[reward]
chat_system_445902629_snap_7_answer_0=^?^Thank you, granny. I was glad to help.
